[
  {
    "id": "1",
    "nome": "Games Camp",
    "description": "Desenvolvimento de uma aplicação para a divulgação do evento da GamesCamp 2024. O projeto foi desenvolvido como parte do desafio da trilha do Nadic, utilizando React, StyledComponents e TypeScript.",
    "poster": "/tumbs/gamesCamp-poster.png",
    "stacks": [
      "React",
      "Sonner",
      "Styled-Components",
      "TypeScript",
      "React-Router-Dom"
    ],
    "deploy": "https://games-camp-react.vercel.app",
    "github": "https://github.com/Dom-Garotom/GamesCamp-React",
    "readme": "<img src=\"/tumbs/gamesCamp-poster.png\" alt=\"Imagem ilustrativa do evento\" width=\"100%\" />\n\n\n<img src=\"/tumbs/gamesCamp-poster-2.png\" alt=\"Imagem ilustrativa do evento\" width=\"100%\" />\n\n\n# GamesCamp - Desafio Nadic\n\nEste projeto foi desenvolvido como parte do desafio da trilha do Nadic, utilizando React, StyledComponents e TypeScript para criar uma interface visual e interativa de um evento fictício. O objetivo deste desafio é simular o desenvolvimento de uma aplicação visual para a gestão de eventos, aplicando conceitos de frontend.\n\nNessa segunda parte do desafio foi adicionada uma página de confirmação de inscrição em relação ao projeto inicial, como também melhorias na responsividade e no design system dos componentes do projeto.\n\nEsse projeto, mesmo simples, foi um grande aprendizado sobre Styled Components e a criação de um design system próprio, me ajudando a aumentar minha experiência como programador. Que venha o próximo desafio!\n\n## Tecnologias Utilizadas:\n- React\n- TypeScript\n- Styled Components\n- React Router DOM\n- Notion\n\n## Como Rodar o Projeto:\nClone o repositório:\n\n      bash\ngit clone https://github.com/Dom-Garotom/GamesCamp.git\n      \n\nNavegue até o diretório do projeto:\n\n      bash\ncd gamesCamp\n      \n\nExecute o projeto em localhost:\n\n      bash\nnpm run dev\n      \n\n",
    "star": true
  },
  {
    "id": "2",
    "nome": "White Corals",
    "description": "Criação de um sistema de controle de inscrições e submissão de artigos para um evento científico sobre o tema 'Branqueamento de Corais'",
    "poster": "/tumbs/whiteCorals/white-coral-login.png",
    "stacks": [
      "Next",
      "Sonner",
      "Styled-Components",
      "TypeScript",
      "Axios"
    ],
    "deploy": "https://white-corals.vercel.app/login",
    "github": "https://github.com/Dom-Garotom/white-corals?tab=readme-ov-file",
    "readme": "# Sistema de Controle de Inscrições para Evento Científico\n\nEste projeto foi desenvolvido utilizando Next.js e tem como objetivo criar um sistema de controle de inscrições para um evento científico sobre o tema \"Branqueamento de Corais\". O sistema permite que usuários se inscrevam no evento, publiquem artigos científicos e que administradores acompanhem o número de inscrições e artigos submetidos.\n\n## O Projeto\n\nUma das grandes satisfações deste projeto foi a capacidade de traduzir uma ideia em uma aplicação funcional. A tela de login é o primeiro contato do usuário com o sistema e busca transmitir uma sensação de acolhimento. Aqui está uma visão das principais telas:\n\n### Tela de login\n![Tela de login](/tumbs/whiteCorals/white-coral-login.png)\n\n### Tela da Home\n![Tela da Home](/tumbs/whiteCorals/white-coral-home.png)\n\n### Tela de preview dos artigos\n![Tela de preview dos artigos](/tumbs/whiteCorals/white-coral-preview.png)\n\n### Tela do Artigo\n![Tela do Artigo](/tumbs/whiteCorals/white-coral-artigo.png)\n\n### Tela de postar Arquivo\n![Tela de postar Arquivo](/tumbs/whiteCorals/white-coral-create-post.png)\n\n### Tela do Dashboard\n![Tela do Dashboard](/tumbs/whiteCorals/white-coral-dashBoard.png)\n\n## Tecnologias Utilizadas\n\n- Next.js: Um framework React que permite renderização híbrida e fácil roteamento de páginas.\n- Axios: Biblioteca usada para consumo de APIs e integração de dados.\n- Styled Components: Utilizado para a criação de componentes estilizados com CSS-in-JS, garantindo escopo de estilo e facilidade na manutenção de design.\n- Cookies e Local Storage: Gerenciamento de sessões de usuários e persistência de informações.\n\n## Desafios e Aprendizados\n\nUm dos principais desafios que enfrentei foi a implementação do Styled Components. No início, me senti um pouco perdido na forma como os estilos eram aplicados aos componentes, mas, à medida que fui praticando e me familiarizando com a biblioteca, consegui criar um design coeso e visualmente agradável. Aprender a usar Styled Components me permitiu perceber o poder do CSS-in-JS e como ele pode simplificar a manutenção de estilos em projetos maiores.\n\nAlém disso, me inspirei em pessoas que admiro para desenhar as telas. Foi gratificante ver como as referências se transformaram em algo concreto, e isso realmente elevou a qualidade do design do projeto. A experiência de criar uma interface que fosse não apenas funcional, mas também esteticamente agradável, foi extremamente recompensadora.\n\nOutro grande aprendizado foi em relação aos  padrões de commit do Git . Embora no início eu não tivesse um padrão claro, com o tempo aprendi a importância de manter um histórico de commits organizado e informativo. Isso não apenas ajuda na colaboração com outros desenvolvedores, mas também me permitiu entender melhor a evolução do projeto.\n\n## Funcionalidades\n\n1.  Sistema de Inscrições : Usuários podem se inscrever para o evento através do formulário de cadastro.\n2.  Publicação de Artigos : Após o registro, usuários podem submeter artigos relacionados ao evento.\n3.  Painel Administrativo : Administradores podem visualizar a quantidade de inscritos e de artigos submetidos.\n\n## Autenticação\n\nO sistema conta com autenticação de usuários, permitindo login e acesso a áreas restritas. A autenticação utiliza cookies e armazenamento no Local Storage para persistir as informações da sessão do usuário.",
    "star": true
  },
  {
    "id": "3",
    "nome": "Gerenciador de tarefas",
    "description": "Criação de um gerenciador de tarefas para aplicação dos conhecimentos aprendidos em estudos e teste para uma vaga front-end.",
    "poster": "/tumbs/gerenciadorDeTarefas.png",
    "stacks": [
      "CSS",
      "HTML",
      "Javscript",
      "LocalStorage"
    ],
    "deploy": "https://dom-garotom.github.io/Gerenciador-de-tarefas/",
    "github": "https://github.com/Dom-Garotom/Gerenciador-de-tarefas",
    "readme": "<img src=\"/tumbs/gerenciadorDeTarefas.png\" width=\"100%\" alt=\"imagem ilustrativa do projeto\"/>\n\n# Gerenciador de Tarefas\n\nUm aplicativo simples para gerenciar tarefas diárias, permitindo adicionar, concluir e remover tarefas. O projeto utiliza HTML, CSS e JavaScript puro, armazenando dados localmente no navegador. Foi criado a partir de um desafio de uma vaga front-end com o objetivo de ganhar mais experiência e aprender como funciona um teste para uma vaga.\n\n## Funcionalidades\n\n- Adicionar novas tarefas.\n- Marcar tarefas como concluídas.\n- Remover tarefas pendentes.\n- Exibir a data atual e o dia da semana.\n- Armazenar dados localmente usando localStorage.\n- Realizar buscas por tarefas.\n\n## Estrutura do Projeto\n\n- index.html: Estrutura básica do HTML.\n- styles.css: Estilização do aplicativo.\n- script.js: Lógica do aplicativo.\n\n## Como Usar\n\n1.   Adicionar Tarefas  : Digite a tarefa no campo de entrada e pressione \"Enter\" ou clique em \"Adicionar\".\n2.   Concluir Tarefas  : Clique no ícone de verificação ao lado da tarefa para marcá-la como concluída.\n3.   Remover Tarefas  : Clique no ícone de menos ao lado da tarefa para removê-la da lista.\n4.   Buscar Tarefas  : Utilize o campo de busca para encontrar tarefas específicas.\n\n## Como Funciona\n\nO aplicativo utiliza localStorage para armazenar tarefas pendentes e concluídas, permitindo que os dados persistam entre as sessões do navegador. As tarefas são atualizadas em tempo real na interface do usuário.",
    "star": false
  },
  {
    "id": "4",
    "nome": "Site da Escola de Inglês - Lingua",
    "description": "Um site criado para uma escola de inglês chamada Lingua, desenvolvido com o intuito de praticar o uso de Next.js, Tailwind CSS e ShadCn.",
    "poster": "/tumbs/tumb-lingua.png",
    "stacks": [
      "Next.js",
      "Tailwind CSS",
      "ShadCn"
    ],
    "deploy": "https://example.com/site-lingua",
    "github": "https://github.com/Dom-Garotom/Lingua",
    "readme": "<img src=\"/tumbs/tumb-lingua.png\" width=\"100%\" alt=\"imagem ilustrativa do site da escola de inglês\"/>\n\n# Site da Escola de Inglês - Lingua\n\nEste projeto é um site para uma escola de inglês chamada   Lingua  . O objetivo principal foi praticar a utilização de   Next.js  ,   Tailwind CSS   e   ShadCn  , criando uma aplicação responsiva e moderna.\n\n## Tecnologias Utilizadas\n\n-   Next.js  : Framework React para renderização do lado do servidor e navegação eficiente entre páginas.\n-   Tailwind CSS  : Biblioteca utilitária para estilização rápida e customizada de componentes.\n-   ShadCn  : Componentes estilizados integrados para construção de interfaces consistentes.\n\n## Funcionalidades\n\n- Páginas informativas sobre os cursos oferecidos pela escola.\n- Navegação rápida e otimizada entre seções do site.\n- Estilização moderna e responsiva usando Tailwind CSS.\n\n## Como Rodar o Projeto\n\nClone o repositório:\n\n```bash\ngit clone https://github.com/usuario/site-lingua.git\n```\n\nNavegue até o diretório do projeto:\n\n```bash\ncd site-lingua\n```\n\nExecute o projeto localmente:\n\n```bash\nnpm run dev\n```\n\nAbra o navegador e acesse:\n\n```\nhttp://localhost:3000\n```",
    "star": false
  },
  {
    "id": "5",
    "nome": "Eduster: Gerenciamento de Salas",
    "description": "Eduster é uma plataforma de gerenciamento e agendamentos de salas desenvolvida como parte de um projeto universitário para ensinar sobre as etapas de desenvolvimento de um projeto real.",
    "poster": "/tumbs/tumb-eduster.png",
    "stacks": [
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "deploy": "https://dom-garotom.github.io/Projeto---Eduster-/",
    "github": "https://github.com/Dom-Garotom/Projeto---Eduster-",
    "readme": "# Eduster: Sistema de Agendamento e Gerenciamento de Salas\n\n![Imagem ilustrativa do site](/tumbs/tumb-eduster.png)\n\n## Descrição\n\nA   Eduster   é uma plataforma de gerenciamento e agendamentos de salas. Este projeto foi desenvolvido na matéria de Web Design na faculdade, com o objetivo de ensinar sobre as etapas de desenvolvimento de um projeto real, além de utilizar tecnologias e conceitos vistos em sala. A aplicação é desenvolvida com   JavaScript  ,   HTML   e   CSS  , além de algumas bibliotecas extras.\n\n## Tecnologias Utilizadas\n\n-   HTML  : Estrutura básica da aplicação.\n-   CSS  : Estilização e layout responsivo.\n-   JavaScript  : Lógica do aplicativo e interatividade.\n\n## Funcionalidades\n\n- Agendamento de salas: Usuários podem reservar salas de forma prática.\n- Confirmação de agendamentos: Modais são utilizados para confirmar os agendamentos.\n- Listagem de salas: Visualização de salas ocupadas e livres.\n- Autenticação de usuários: Sistema de login e registro para gerenciar acessos (em desenvolvimento).\n\n## 📈 Status de Desenvolvimento\n\n- [x] Criação das páginas iniciais.\n- [x] Criação do responsivo das páginas iniciais.\n- [x] Criação das páginas de login e registro.\n- [x] Criação do responsivo das páginas de login e registro.\n- [ ] Criação da verificação e autenticação das páginas de login e registro.\n- [ ] Criação da página principal do projeto.\n- [ ] Criação do responsivo da página principal.\n- [x] Criação dos modais para agendar as salas.\n- [x] Responsivo dos modais para agendar as salas.\n- [x] Criação dos modais para confirmar os agendamentos e modais de dúvidas.\n- [ ] Criação do modal para listar salas ocupadas e vazias.\n- [x] Responsivo do modal para listar salas.\n- [ ] Atualizar o responsivo da página dos pacotes.\n\n## Desafios Enfrentados\n\n- Desenvolvimento de uma interface responsiva.\n- Criação de modais dinâmicos para uma experiência de usuário fluida.\n- Implementação de um sistema de autenticação.\n\n## Próximos Passos\n\n- Finalizar a implementação do sistema de autenticação.\n- Desenvolver a página principal com todas as funcionalidades ativas.\n- Implementar melhorias contínuas com base em feedbacks dos usuários.\n\n",
    "star": false
  },
  {
    "id": "6",
    "nome": "Links Native",
    "description": "Este projeto é uma aplicação em React Native desenvolvida durante o minicurso da Rocketseat. A aplicação permite o armazenamento e a organização de links por categorias, com funcionalidades para adicionar, listar e remover links.",
    "poster": "/tumbs/tumb-linksNative.png",
    "stacks": [
      "React Native",
      "Expo",
      "AsyncStorage",
      "UUID",
      "React Navigation"
    ],
    "deploy": "https://github.com/Dom-Garotom/Links-Native",
    "github": "https://github.com/Dom-Garotom/Links-Native",
    "readme": "# Links Native: Gerenciamento de Links por Categorias\n\n\n\n![Imagem ilustrativa do aplicativo](/tumbs/tumb-linksNative.png)\n\n\n\n## Descrição\n\nO Links Native é um aplicativo mobile desenvolvido com React Native, que permite o armazenamento e a organização de links por categorias. O projeto foi criado durante o minicurso da Rocketseat e oferece funcionalidades de adicionar, listar e remover links.\n\n## Tecnologias Utilizadas\n\n- React Native: Base do desenvolvimento da interface mobile.\n- Expo: Ambiente de desenvolvimento rápido e compatível com React Native.\n- AsyncStorage: Utilizado para armazenamento local dos links.\n- UUID: Geração de identificadores únicos para cada link.\n- React Navigation: Gerenciamento de navegação entre telas.\n\n## Funcionalidades\n\n- Adicionar Link: Permite ao usuário adicionar um link informando o nome, URL e categoria.\n- Listar Links por Categoria: Visualiza os links conforme a categoria escolhida.\n- Remover Link: Remove links previamente adicionados.\n- Feedbacks ao Usuário: Mensagens de alerta informam sobre ações bem-sucedidas ou erros.\n\n## 📈 Status de Desenvolvimento\n\n- [x] Implementação das funcionalidades básicas (adicionar, listar e remover links).\n- [x] Feedback visual e mensagens de confirmação.\n- [ ] Melhorias na performance e otimizações de UX.\n- [ ] Testes e validação para ambientes de produção.\n\n## Desafios Enfrentados\n\n- Adaptação de conhecimentos prévios em React para o React Native.\n- Gestão de armazenamento local com AsyncStorage.\n\n## Próximos Passos\n\n- Implementar otimizações de UX e performance.\n- Explorar recursos adicionais do Expo para futuras funcionalidades.\n\n",
    "star": false
  },
  {
    "id": "7",
    "nome": "MyGarden",
    "description": "MyGarden é um aplicativo de cuidados com plantas desenvolvido em React Native com Expo. Ele ajuda os usuários a gerenciar o cuidado de suas plantas, oferecendo lembretes personalizados, notificações automatizadas e ferramentas de diagnóstico para monitorar o bem-estar das plantas.",
    "poster": "/tumbs/tumb-myGarden.png",
    "stacks": [
      "React Native",
      "Expo",
      "JavaScript"
    ],
    "deploy": "https://dom-garotom.github.io/Projeto---MyGarden-/",
    "github": "https://github.com/Dom-Garotom/MyGarden",
    "readme": "# MyGarden: Aplicativo de Cuidados com Plantas\n\n![Imagem ilustrativa do aplicativo](/tumbs/tumb-mygarden.png)\n\n \n\n![Imagem ilustrativa do aplicativo](/tumbs/screens-myGarden.png)\n\n## Descrição\n\nO MyGarden é um aplicativo de cuidados com plantas desenvolvido com React Native e Expo. Ele oferece aos usuários uma plataforma completa para gerenciar o cuidado de suas plantas, incluindo lembretes personalizados, notificações automáticas e diagnósticos de saúde das plantas.\n\n## Objetivo\n\nO objetivo do MyGarden é fornecer uma experiência completa e intuitiva para os cuidados com plantas, com funcionalidades que incluem:\n\n- Lembretes personalizados para rega e cuidados específicos.\n- Diagnóstico avançado de problemas comuns das plantas.\n- Registro visual do crescimento e progresso das plantas.\n- Informações detalhadas sobre temperatura e umidade ajustadas ao ambiente do usuário.\n\n## Funcionalidades\n\n- **Cadastro de Plantas**: Permite que o usuário adicione suas plantas com informações personalizadas, incluindo nome, categoria e preferências de cuidados.\n- **Notificações Automáticas**: Notificações com o Expo Push Notification lembram o usuário de regar as plantas no horário desejado.\n- **Diagnóstico**: Ferramenta para análise de problemas das plantas, oferecendo sugestões de cuidados.\n- **Conexão com API**: Dados atualizados de temperatura e umidade, para um cuidado mais eficaz com base nas condições do ambiente.\n\n## Como Funcionam as Notificações\n\nUtilizando o Expo Push Notification, o MyGarden envia lembretes automáticos para que o usuário cuide de suas plantas. Os horários são configurados pelo usuário e programados no sistema de notificações do Expo. O aplicativo permite:\n\n- Agendar notificações de acordo com o horário e frequência de rega de cada planta.\n- Personalizar o conteúdo de cada notificação para incluir informações específicas da planta e do tipo de cuidado necessário.\n\n## Figma\n\nPara uma prévia do design do projeto, acesse o link do Figma do MyGarden:\n\n[Link do Figma](https://figma.com/your-figma-link)\n\n## Como Contribuir\n\n1. Faça um fork do projeto.\n\n   ```bash\n   git clone https://github.com/Dom-Garotom/MyGarden.git\n   ```\n\n2. Crie uma branch para a nova funcionalidade:\n\n   ```bash\n   git checkout -b minha-feature\n   ```\n\n3. Faça commit das suas alterações:\n\n   ```bash\n   git commit -m 'Adicionar nova funcionalidade'\n   ```\n\n4. Envie para o branch principal:\n\n   ```bash\n   git push origin minha-feature\n   ```\n\n5. Abra um pull request.",
    "star": true
  }
]